[
  {
    "quote": "Management is too important to leave to the managers.",
    "author": "Jurgen Appelo",
    "lastPostDateTime": "2021-06-30T18:53:46.6844729-06:00"
  },
  {
    "quote": "As a company, it is essential that you have the developers conducting the interviews. As a candidate, if developers do not interview you, consider finding a job somewhere else.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "2021-06-30T18:16:55.5664005-06:00"
  },
  {
    "quote": "Quality is everyone\u0027s responsibility.",
    "author": "W. Edwards Deming",
    "lastPostDateTime": "2021-06-30T18:19:23.363581-06:00"
  },
  {
    "quote": "The biggest cause of failure in software-intensive systems is not technical failure; it’s building the wrong thing.",
    "author": "Mary Poppendieck",
    "lastPostDateTime": "2021-06-29T22:09:45.7189733-06:00"
  },
  {
    "quote": "Truth can only be found in one place: the code. Only the code can truly tell you what it does. It is the only source of truly accurate information. Therefore, though comments are sometimes necessary, we will expend significant energy to minimize them.",
    "author": "Robert Martin",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "It is very important to defer public commitment to exactly which features will be in the product, because this makes it possible to reliably release the product on time. The release date is guaranteed, but the exact features are not. Timebox—don’t scopebox.",
    "author": "Mary Poppendieck",
    "lastPostDateTime": "2021-06-30T21:56:02.6089094-06:00"
  },
  {
    "quote": "Agile processes promote sustainable development. The sponsors, developers, and users should be able to maintain a constant pace indefinitely.",
    "author": "Principles behind the Agile Manifesto",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "There are things that can be measured. There are things that are worth measuring. But what can be measured is not always what is worth measuring; what gets measured may have no relationship to what we really want to know. The costs of measuring may be greater than the benefits. The things that get measured may draw effort away from the things we really care about. And measurement may provide us with distorted knowledge - knowledge that seems solid but is actually deceptive.",
    "author": "Jerry Z. Muller",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "The principles behind Agile [can be] forgotten. Process [can become] more important than technical excellence. Technical excellence, which is assumed to be in place by every process-related Agile methodology, is normally ignored by managers and ill-prepared Agile coaches.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Facts do not cease to exist because they are ignored.",
    "author": "Aldous Huxley",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "I want to always have the option to make mistakes, and to pay as little as possible for those mistakes.  Sometimes I must pay a lot for our mistakes. Still, I prefer to find ways to keep the price tiny when I can.",
    "author": "Woody Zuill",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "One difference between a smart programmer and a professional programmer is that the professional understands that clarity is king. Professionals use their powers for good and write code that others can understand.",
    "author": "Robert Martin",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "The biggest problem [with code] is that bad code is invisible to everyone besides the developers. Other members of the team only realize that something is wrong when it is too late. That means it is the developers’ responsibility to look after the quality of the code.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "The most important practice for continuous integration to work properly is frequent check-ins to trunk or mainline. You should be checking in your code at least a couple of times a day.",
    "author": "Jez Humble \u0026 David Farley",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Information is not knowledge. Let’s not confuse the two.",
    "author": "W. Edwards Deming",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Metric fixation is the seemingly irresistible pressure to measure performance, to publicize it, and to reward it, often in the face of evidence that this just doesn\u0027t work very well. Used properly, measurement...can be a good thing. So can transparency. But they can also distort, divert, displace, distract, and discourage. While we are bound to live in an age of measurement, we live in an age of mismeasurement, over-measurement, misleading measurement, and counter-productive measurement. This book [The Tyranny of Metrics] is not about the evils of measuring. It is about the unintended negative consequences of trying to substitute standardized measures of performance for personal judgement based on experience. The problem is not measurement, but excessive measurement and inappropriate measurement - not metrics, but metric fixation.",
    "author": "Jerry Z. Muller",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Never confuse movement with action.",
    "author": "Ernest Hemingway",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Flow efficiency is a measurement of how much a flow unit is processed during a specific time period. The time period is defined from the time a need is identified to the time it is satisfied.",
    "author": "Niklas Modig \u0026 Par Ahlstrom",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Delegation of control is the only way to manage complex systems. There is no other option.",
    "author": "Jurgen Appelo",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Simplicity--the art of maximizing the amount of work not done--is essential.",
    "author": "Principles behind the Agile Manifesto",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Dedicated QA teams are an anti-pattern. Testers should find nothing. Zero. Nada. Every time a tester finds a bug, developers should feel bad about it. Every bug found is an indication of something that we haven’t done properly.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "You can only create new value when you protect what is already valuable...When you increase short-term productivity while cutting corners in quality, you\u0027re not creating value; you\u0027re just stealing it from the future.",
    "author": "Jurgen Appelo",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "It is hard to let go of the long-held belief that strong, centralized control provides valuable efficiencies. However well it may have served us in an era of lower complexity and slower technical advances, it now creates barriers that prevent us from adapting quickly to emerging opportunities.",
    "author": "Jez Humble",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Rewards may briefly motivate people who win them, but they also seriously demotivate those who don\u0027t. The net result is often more negative than positive. For every person you make \u0027employee of the month\u0027 you turn dozens, hundreds, or thousands of colleagues into \u0027losers of the month.",
    "author": "Jurgen Appelo",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "...if you\u0027re afraid to change something it is clearly poorly designed.",
    "author": "Martin Fowler",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "There’s always more to build than we have time or resources to build — always.",
    "author": "Jeff Patton",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Innovation comes from people who take joy in their work.",
    "author": "W. Edwards Deming",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Amateurs work until they get it right. Professionals work until they can’t get it wrong.",
    "author": "Author Unknown",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Confusing common causes with special causes will only make things worse.",
    "author": "W. Edwards Deming",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Agile processes promote sustainable development. The sponsors, developers, and users should be able to maintain a constant pace indefinitely.",
    "author": "Principles behind the Agile Manifesto",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Quality is pride of workmanship.",
    "author": "W. Edwards Deming",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Improve quality, you automatically improve productivity.",
    "author": "W. Edwards Deming",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "If you adopt only one agile practice, let it be retrospectives. Everything else will follow.",
    "author": "Woody Zuill",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Handing off all the details about the story to someone else to build doesn’t work. Don’t do that.",
    "author": "Jeff Patton",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "If it hurts, do it more frequently, and bring the pain forward.",
    "author": "Jez Humble \u0026 David Farley",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Working software is the primary measure of progress.",
    "author": "Principles behind the Agile Manifesto",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "A Standish Group study found that 45 percent of features in a typical system are never used and 19 percent are rarely used.",
    "author": "Mary Poppendieck",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Laziness: The quality that makes you go to great effort to reduce overall energy expenditure. It makes you write labor-saving programs that other people will find useful and document what you wrote so you don\u0027t have to answer so many questions about it.",
    "author": "Larry Wall",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Are we noted for quality?",
    "author": "W. Edwards Deming",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Writing the first 90 percent of a computer program takes 90 percent of the time. The remaining ten percent also takes 90 percent of the time and the final touches also take 90 percent of the time.",
    "author": "N.J. Rubenking",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "It is a mistake to assume that if everybody does his job, it will be all right. The whole system may be in trouble.",
    "author": "W. Edwards Deming",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "The Three Laws of TDD:  1) You may not write production code until you have written a failing unit test. 2) You may not write more of a unit test than is sufficient to fail, and not compiling is failing. 3) You may not write more production code than is sufficient to pass the currently failing test.",
    "author": "Robert Martin",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "When you feel the need to write a comment, first try to refactor the code so that any comment becomes superflouus.",
    "author": "Martin Fowler",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "It would be much better to assign work to established teams than to reconstitute teams around projects.",
    "author": "Mary Poppendieck",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "People are entitled to joy in work.",
    "author": "W. Edwards Deming",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Unless someone like you cares a whole awful lot, nothing is going to get better. It’s not.",
    "author": "Dr. Seuss",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Impatience: The anger you feel when the computer is being lazy. This makes you write programs that don\u0027t just react to your needs, but actually anticipate them. Or at least pretend to.",
    "author": "Larry Wall",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "No major piece of work should be fully funded before we have evidence to support the business and economic model on which it is based, and this exploration must be done with small, cross-functional teams with a limited runway.",
    "author": "Jez Humble",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "The problem with quick and dirty, is that the dirty remains long after the quick has been forgotten.",
    "author": "Steve C. McConnell",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "I fight for the users!",
    "author": "Tron",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "There are only two hard things in Computer Science: cache invalidation and naming things.",
    "author": "Phil Karlton",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "A relentless barrage of \u0022why’s\u0022 is the best way to prepare your mind to pierce the clouded veil of thinking caused by the status quo. Use it often.",
    "author": "Shigeo Shingo",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "We have come to value...Working software over comprehensive documentation.",
    "author": "Agile Manifesto",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "A good programmer is someone who always looks both ways before crossing a one-way street.",
    "author": "Doug Linder",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Programming is not a zero-sum game. Teaching something to a fellow programmer doesn’t take it away from you.",
    "author": "John Carmack",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "A goal without a method is nonsense.",
    "author": "W. Edwards Deming",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "There\u0027s a way to do it better - find it.",
    "author": "Thomas A. Edison",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "If someone can make a contribution to the company he feels important.",
    "author": "W. Edwards Deming",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "At regular intervals, the team reflects on how to become more effective, then tunes and adjusts its behavior accordingly.",
    "author": "Principles behind the Agile Manifesto",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "The best way to achieve predictable software development outcomes is to start early, learn constantly, commit late, and deliver fast.",
    "author": "Mary Poppendieck",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "I’ll tell you exactly what DevOps means. DevOps means caring about your job enough to not pass the buck. DevOps means caring about your job enough to want to learn all the parts and not just your little world. Developers need to understand the infrastructure, operations people need to understand code, people need to actually work with each other and not just occupy space next to each other.",
    "author": "Jez Humble paraphrasing John Vincent",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Any fool can write code that a computer can understand. Good programmers write code that humans can understand.",
    "author": "Martin Fowler",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Programmers don’t burn out on hard work, they burn out on change-with-the-wind directives and not ‘shipping’",
    "author": "Mark Berry",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Management’s job is to improve the system.",
    "author": "W. Edwards Deming",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Deliver working software frequently, from a couple of weeks to a couple of months, with a preference to the shorter timescale.",
    "author": "Principles behind the Agile Manifesto",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "The majority of the cost of a software project is in long-term maintenance.",
    "author": "Robert Martin",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Should array indices start at 0 or 1? My compromise of 0.5 was rejected without, I thought, proper consideration.",
    "author": "Stan Kelly-Bootle",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Luck is not a factor. Hope is not a strategy. Fear is not an option.",
    "author": "James Cameron",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Bad behavior arises when you abstract people away from the consequences of their actions. Functional silos abstract people away from the consequences of their actions.",
    "author": "Jez Humble",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Hubris: The quality that makes you write (and maintain) programs that other people won\u0027t want to say bad things about.",
    "author": "Larry Wall",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "The bitterness of poor quality remains long after the sweetness of meeting the schedule has been forgotten.",
    "author": "Anonymous",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Our highest priority is to satisfy the customer through early and continuous delivery of valuable software.",
    "author": "Principles behind the Agile Manifesto",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "There should be two tasks for a human being to perform to deploy software into a development, test, or production environment: to pick the version and environment and to press the \u0027deploy\u0027 button.",
    "author": "Jez Humble \u0026 David Farley",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "The long-term value of an enterprise is not captured by the value of its products and intellectual property but rather by its ability to continuously increase the value it provides to customers — and to create new customers — through innovation.",
    "author": "Jez Humble",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Build projects around motivated individuals. Give them the environment and support they need, and trust them to get the job done.",
    "author": "Principles behind the Agile Manifesto",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Work expands so as to fill the time available for its completion.",
    "author": "C. Northcote Parkinson",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "You measure system capability; you do not prescribe it.",
    "author": "Mary Poppendieck",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "The result of long-term relationships is better and better quality, and lower and lower costs.",
    "author": "W. Edwards Deming",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "If you destroy the people of a company, you do not have much left.",
    "author": "W. Edwards Deming",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Management by results is confusing special causes with common causes.",
    "author": "W. Edwards Deming",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Not \u0027can we build it?\u0027 but \u0027should we build it?\u0027",
    "author": "Jez Humble",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "No one knows the cost of a defective product - don\u0027t tell me you do. You know the cost of replacing it, but not the cost of a dissatisfied customer.",
    "author": "W. Edwards Deming",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live.",
    "author": "Martin Golding",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Control projects by quantified critical-few, results. The worst scenario I can imagine is when we allow real customers, users, and our own salespeople to dictate ‘functions and features’ to the developers, carefully disguised as ‘customer requirements’.",
    "author": "Mary Poppendieck",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Controlling complexity is the essence of computer programming.",
    "author": "Brian Kernighan",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "For every complex problem there is an answer that is clear, simple, and wrong.",
    "author": "H. L Mencken",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Simplicity is a great virtue but it requires hard work to achieve it and education to appreciate it. And to make matters worse: complexity sells better.",
    "author": "Edsger W. Dijkstra",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Problems are inevitable but solvable.",
    "author": "David Deutsch",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "The way to go fast, and to keep the deadlines at bay, is to stay clean. Professionals do not succumb to the temptation to create a mess in order to move quickly. Professionals realize that \u0022quick and dirty\u0022 is an oxymoron. Dirty always means slow!",
    "author": "Robert C. Martin",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Teams are most effective when the team members collaborate professionally. It is unprofessional to be a loner or a recluse on a team.",
    "author": "Robert C. Martin",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Professionals will always help the business find a way to achieve its goals. But professionals do not necessarily accept commitments made for them by the business.",
    "author": "Robert C. Martin",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "You know what you believe by observing yourself in a crisis. If in a crisis you follow your disciplines, then you truly believe in those disciplines. On the other hand, if you change your behavior in a crisis, then you don\u0027t truly believe in your normal behavior.",
    "author": "Robert C. Martin",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "We can avoid pressure by keeping our system, our code, and our design as clean as possible. This does not mean that we spend endless hours polishing code. It simply means that we don\u0027t tolerate messes. We know that messes will slow us down, causing us to miss dates and break commitments.",
    "author": "Robert C. Martin",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "If you want to have nice things, you have to remove the not-nice things.",
    "author": "Joel Spolsky",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "It’s important to ask ourselves questions such as: Do we really need estimates? Are they really that important?  Are there options? Are there other ways to do things? Are there BETTER ways to do things?",
    "author": "Woody Zuill",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "The days when software developers are specialized in only one thing are numbered. The old attitude we had - if it is not coding, it\u0027s not my problem - is now unacceptable. Companies started to get leaner, flattening their hierarchies and replacing many one-trick-pony professionals with generalizing specialists. Companies are looking for developers who, besides being great at writing code, can also help in many other areas of the business.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "The much talked about software backlog is a myth. We all know that projects cost a lot more at the end than what we expected them to cost at the beginning.  So the cost of a system that didn\u0027t get built this year (because we didn\u0027t have the capacity for it) is optimistically assumed to be half of what it would actually cost to build, or even less.  The typical project that\u0027s stuck in the mythical backlog is there because it has barely enough benefit to justify building it, even with the most optimistic cost assumptions.",
    "author": "Tom DeMarco and Timothy Lister",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "This new reality in the software industry forced an evolution of the software development profession. Companies are demanding professional software developers and not just cheap coders who do whatever they are told to do.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Agile does not solve any problems; it exposes them.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "There are a million ways to lose a work day, but not even a single way to get one back.",
    "author": "Tom DeMarco and Timothy Lister",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Being good at writing code is the minimum skill expected from software professionals.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Work-conducive office space is not a status symbol, it\u0027s a necessity.  Either you pay for it by shelling out what it costs, or you pay for it in lost productivity.",
    "author": "Tom DeMarco and Timothy Lister",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Effective processes work from the premise that, in order to achieve quality, we need to provide a great feedback system, at all levels. For a feedback system to work, we need talented and passionate professionals who care enough about what they do, raising their voices when they feel something is wrong or could be done better. Focusing purely on the process and treating software development like a production line leads to average 9-to-5 developers doing what they are told - they become factory workers. This approach makes the feedback system inefficient, compromising the entire project.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Since creativity is a sometime thing anyway, we often don\u0027t notice when there is less of it.  People don\u0027t have a quota for creative thoughts.  The effect of reduced creativity is cumulative over a long period. The organization is less effective, people grind out the work without a spark of excitement, and the best people leave.",
    "author": "Tom DeMarco and Timothy Lister",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "We really did the company and ourselves a disservice. We made loads of mistakes during those long hours, including wiping out the entire production database at 3 A.M. We created things that were totally unnecessary. We had a very poor understanding of the real issues and did not create situations where we could provide better solutions. We allowed ourselves to be deprived of a personal life and even ended up discriminating against those who decided not to sleep in the car park or just work 12 hours a day. We were not acting professionally because we never said NO.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Always saying no is...not a professional attitude. Every no, ideally, should be followed by a list of alternatives.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Managers should appreciate when we say we cannot deliver some features. Although that may be bad news, that information will help to avoid a much bigger problem. Transparency helps managers and the team to prepare for tough situations. Raising the red flag as early as possible, indicating that something is wrong, allows the team and all people involved to be pragmatic and come up with alternative solutions. It frees people to be creative in order to solve the problem. If we manage to deliver what we promised when we said yes, managers will be far more inclined to trust us when we say no.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "In the Agile Manifesto we have working software over comprehensive documentation...This is absolutely great and we all agree with these principles. The problem here is that over the years, the idea of working software moved away from high-quality working software, and many Agile projects are producing code that is way below the standards expected from a real Agile project.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Having an empowered team of craftsmen can be the difference between success and failure of any software project.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "We always feel we need to rush. Sometimes the pressure is put on us by the business, but more often than not, the pressure is self-imposed.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Dedicated QA teams are an anti-pattern. Testers should find nothing. Zero. Nada. Every time a tester finds a bug, developers should feel bad about it. Every bug found is an indication of something that we haven’t done properly.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "People cannot work effectively if their workspace is too enclosed or too exposed.  A good workspace strikes the balance...You feel more comfortable in a workspace if there is a wall behind you...There should be no blank wall closer than 8 feet in front of you.",
    "author": "Tom DeMarco and Timothy Lister",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "When breaking user stories into development tasks, I have seen many developers creating a “unit test” task card. The reason was that they wanted to assign formal time to it. No, we should never do that. Ever.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Practices are what we consistently do on a daily basis; we either do TDD or we don’t do TDD; we either have continuous integration or we don’t have continuous integration. Some people say, “We do TDD...sometimes.” That doesn’t help. In order to measure their benefits, practices must be adopted wholeheartedly.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "People were charmed by differentness, they like the attention, they were intrigued by novelty.  This has come to be called the Hawthorne Effect.  Loosely stated, it says that people perform better when they\u0027re trying something new.",
    "author": "Tom DeMarco and Timothy Lister",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "We spend far more time with our colleagues than we spend with our loved ones – which makes it even more important that we trust and have great relationships with them. The truth is that if you cannot allocate enough time to interview, you can’t really be serious about building a great team.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Job descriptions are anti-patterns...Job descriptions are designed to weed out the worst, not attract the best. Top developers do not apply for experience-based job descriptions. They are usually more selective when choosing where they want to work.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  },
  {
    "quote": "Job descriptions are totally discouraged, but if one is needed, the focus should be on detailing the expected attitude and responsibilities, types of projects, technologies used (not required), and values and culture of the company.",
    "author": "Sandro Mancuso",
    "lastPostDateTime": "0001-01-01T00:00:00+00:00"
  }
]